Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАвтозагрузкеАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/CommonForms/КоэффицентСпросаТовара/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	/// Комлев АА 19/11/24 +++
	ВсеГода = 1;
	Элементы.Год.СписокВыбора.ЗагрузитьЗначения(СформироватьСвойМассивЗначений());
	ДатаПолгодаНазад = ДобавитьМесяц(ТекущаяДата(), - 6);
	СписокНоменклатурыКоэффицент.Параметры.УстановитьЗначениеПараметра("ДатаПолгодаНазад", НачалоДня(ДатаПолгодаНазад));
	КоличествоТоваровВКатегрии.Параметры.УстановитьЗначениеПараметра("ДатаПолгодаНазад", НачалоДня(ДатаПолгодаНазад));
	УсловноеОФормлениеСписокТоваровКоэффицент() ;
	/// Комлев АА 19/11/24 ---
КонецПроцедуры

&НаКлиенте
Процедура ГодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	/// Комлев АА 14/11/24 +++
	СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.ЗагрузитьЗначения(СформироватьСвойМассивЗначений());
	/// Комлев АА 14/11/24 ---
КонецПроцедуры

Функция СформироватьСвойМассивЗначений()
	
	/// Комлев АА 14/11/24 +++
	МассивГодов = Новый Массив;
	МассивГодов.Добавить(Дата(Год(ТекущаяДата()), 1, 1));
	Индекс = 7;
	ТекДата = ТекущаяДата();
	Пока Индекс <> 0 Цикл
		ТекДата =  ДобавитьМесяц(ТекДата, -12);
		МассивГодов.Добавить(Дата(Год(ТекДата), 1, 1));
		Индекс = Индекс - 1;
	КонецЦикла;
	Возврат МассивГодов;
	/// Комлев АА 14/11/24 ---
КонецФункции

&НаКлиенте
Процедура ГодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Год = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	/// Комлев АА 19/11/24 +++
	ВсеГода = 2;
	КоэффицентПоГоду();
	/// Комлев АА 19/11/24 ---
КонецПроцедуры

Процедура КоэффицентПоГоду()
	/// Комлев АА 19/11/24 +++
	Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
	|ПОМЕСТИТЬ ТоварыИзЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, Год) = НачалоПериода(&Дата, Год)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрНакопления1Остатки.Товар КАК Товар,
	|	КОЛИЧЕСТВО(РегистрНакопления1Остатки.КолвоОстаток) КАК КолвоОстаток,
	|	СУММА(ИндНомер.Цена) КАК Сумма
	|ПОМЕСТИТЬ ОстаткиСумма
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|СГРУППИРОВАТЬ ПО
	|	РегистрНакопления1Остатки.Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Товар,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
	|	12 КАК Месяцев,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) / 12 КАК ЧИСЛО(10, 2)) КАК Коэффицент,
	|	ЕСТЬNULL(ОстаткиСумма.КолвоОстаток, 0) КАК КолвоОстаток,
	|	ОстаткиСумма.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) = 0
	|			ТОГДА ""Низкий спрос (Нет заявок)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 0
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 1
	|			ТОГДА ""Категория 8 (1 Заявка)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 1
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 3
	|			ТОГДА ""Категория 7 (от 2 до 3)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 3
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 7
	|			ТОГДА ""Категория 6 (от 3 до 7)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 7
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 13
	|			ТОГДА ""Категория 5 (от 7 до 13)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 13
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 33
	|			ТОГДА ""Категория 4 (от 13 до 33)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 33
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 50
	|			ТОГДА ""Категория 3 (от 33 до 50)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 50
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 100
	|			ТОГДА ""Категория 2 (от 50 до 100)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 100
	|			ТОГДА ""Высокий спрос (от 100)""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
	|		ПО (ТоварыИзЗаявок.Номенклатура = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСумма КАК ОстаткиСумма
	|		ПО (ОстаткиСумма.Товар = СпрНоменклатура.Ссылка)";
	
	
	ТекстСГруппировкой = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
	|ПОМЕСТИТЬ ТоварыИзЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, Год) = НачалоПериода(&Дата, Год)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СпрНоменклатура.Ссылка) КАК КоличествоТоваров,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) = 0
	|			ТОГДА ""Низкий спрос (Нет заявок)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 0
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 1
	|			ТОГДА ""Категория 8 (1 Заявка)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 1
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 3
	|			ТОГДА ""Категория 7 (от 2 до 3)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 3
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 7
	|			ТОГДА ""Категория 6 (от 3 до 7)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 7
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 13
	|			ТОГДА ""Категория 5 (от 7 до 13)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 13
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 33
	|			ТОГДА ""Категория 4 (от 13 до 33)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 33
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 50
	|			ТОГДА ""Категория 3 (от 33 до 50)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 50
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 100
	|			ТОГДА ""Категория 2 (от 50 до 100)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 100
	|			ТОГДА ""Высокий спрос (от 100)""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
	|		ПО (ТоварыИзЗаявок.Номенклатура = СпрНоменклатура.Ссылка)
	|Сгруппировать по
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) = 0
	|			ТОГДА ""Низкий спрос (Нет заявок)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 0
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 1
	|			ТОГДА ""Категория 8 (1 Заявка)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 1
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 3
	|			ТОГДА ""Категория 7 (от 2 до 3)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 3
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 7
	|			ТОГДА ""Категория 6 (от 3 до 7)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 7
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 13
	|			ТОГДА ""Категория 5 (от 7 до 13)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 13
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 33
	|			ТОГДА ""Категория 4 (от 13 до 33)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 33
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 50
	|			ТОГДА ""Категория 3 (от 33 до 50)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 50
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 100
	|			ТОГДА ""Категория 2 (от 50 до 100)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 100
	|			ТОГДА ""Высокий спрос (от 100)""
	|	КОНЕЦ";
	
	СписокНоменклатурыКоэффицент.ПроизвольныйЗапрос = Истина;
	СписокНоменклатурыКоэффицент.ТекстЗапроса = Текст;
	СписокНоменклатурыКоэффицент.Параметры.УстановитьЗначениеПараметра("Дата", Год);
	
	КоличествоТоваровВКатегрии.ПроизвольныйЗапрос = Истина;
	КоличествоТоваровВКатегрии.ТекстЗапроса = ТекстСГруппировкой;
	КоличествоТоваровВКатегрии.Параметры.УстановитьЗначениеПараметра("Дата", Год);
	
	Элементы.СписокНоменклатурыКоэффицент.Обновить();
	Элементы.КоличествоТоваровВКатегрии.Обновить();
	/// Комлев АА 19/11/24 ---
КонецПроцедуры

&НаКлиенте
Процедура ВсеГодаПриИзменении(Элемент)
	/// Комлев АА 19/11/24 +++
	Год = Дата(1, 1, 1);
	Если ВсеГода = 1 Тогда
		ТекстЗапросаВсеКоэффВсеГода();
	КонецЕсли;
	/// Комлев АА 19/11/24 ---
КонецПроцедуры

Процедура ТекстЗапросаВсеКоэффВсеГода()
	/// Комлев АА 19/11/24 +++
	Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
	|ПОМЕСТИТЬ ТоварыИзЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрНакопления1Остатки.Товар КАК Товар,
	|	КОЛИЧЕСТВО(РегистрНакопления1Остатки.КолвоОстаток) КАК КолвоОстаток,
	|	СУММА(ИндНомер.Цена) КАК Сумма
	|ПОМЕСТИТЬ ОстаткиСумма
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|СГРУППИРОВАТЬ ПО
	|	РегистрНакопления1Остатки.Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Товар,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
	|	12 КАК Месяцев,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) / 12 КАК ЧИСЛО(10, 2)) КАК Коэффицент,
	|	ЕСТЬNULL(ОстаткиСумма.КолвоОстаток, 0) КАК КолвоОстаток,
	|	ОстаткиСумма.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) = 0
	|			ТОГДА ""Низкий спрос (Нет заявок)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 0
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 1
	|			ТОГДА ""Категория 8 (1 Заявка)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 1
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 3
	|			ТОГДА ""Категория 7 (от 2 до 3)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 3
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 7
	|			ТОГДА ""Категория 6 (от 3 до 7)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 7
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 13
	|			ТОГДА ""Категория 5 (от 7 до 13)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 13
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 33
	|			ТОГДА ""Категория 4 (от 13 до 33)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 33
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 50
	|			ТОГДА ""Категория 3 (от 33 до 50)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 50
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 100
	|			ТОГДА ""Категория 2 (от 50 до 100)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 100
	|			ТОГДА ""Высокий спрос (от 100)""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
	|		ПО (ТоварыИзЗаявок.Номенклатура = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСумма КАК ОстаткиСумма
	|		ПО (ОстаткиСумма.Товар = СпрНоменклатура.Ссылка)";
	
	ТекстСГруппировкой = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
	|ПОМЕСТИТЬ ТоварыИзЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СпрНоменклатура.Ссылка) КАК КоличествоТоваров,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) = 0
	|			ТОГДА ""Низкий спрос (Нет заявок)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 0
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 1
	|			ТОГДА ""Категория 8 (1 Заявка)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 1
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 3
	|			ТОГДА ""Категория 7 (от 2 до 3)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 3
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 7
	|			ТОГДА ""Категория 6 (от 3 до 7)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 7
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 13
	|			ТОГДА ""Категория 5 (от 7 до 13)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 13
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 33
	|			ТОГДА ""Категория 4 (от 13 до 33)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 33
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 50
	|			ТОГДА ""Категория 3 (от 33 до 50)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 50
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 100
	|			ТОГДА ""Категория 2 (от 50 до 100)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 100
	|			ТОГДА ""Высокий спрос (от 100)""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
	|		ПО (ТоварыИзЗаявок.Номенклатура = СпрНоменклатура.Ссылка)
	|Сгруппировать по
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) = 0
	|			ТОГДА ""Низкий спрос (Нет заявок)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 0
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 1
	|			ТОГДА ""Категория 8 (1 Заявка)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 1
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 3
	|			ТОГДА ""Категория 7 (от 2 до 3)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 3
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 7
	|			ТОГДА ""Категория 6 (от 3 до 7)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 7
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 13
	|			ТОГДА ""Категория 5 (от 7 до 13)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 13
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 33
	|			ТОГДА ""Категория 4 (от 13 до 33)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 33
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 50
	|			ТОГДА ""Категория 3 (от 33 до 50)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 50
	|		и ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) <= 100
	|			ТОГДА ""Категория 2 (от 50 до 100)""
	|		КОГДА СпрНоменклатура.ДатаСоздания < &ДатаПолгодаНазад
	|		И ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) > 100
	|			ТОГДА ""Высокий спрос (от 100)""
	|	КОНЕЦ";
	
	
	СписокНоменклатурыКоэффицент.ПроизвольныйЗапрос = Истина;
	СписокНоменклатурыКоэффицент.ТекстЗапроса = Текст;
	
	КоличествоТоваровВКатегрии.ПроизвольныйЗапрос = Истина;
	КоличествоТоваровВКатегрии.ТекстЗапроса = ТекстСГруппировкой;
	
	Элементы.СписокНоменклатурыКоэффицент.Обновить();
	Элементы.КоличествоТоваровВКатегрии.Обновить();
	/// Комлев АА 19/11/24 ---
КонецПроцедуры

Процедура УсловноеОФормлениеСписокТоваровКоэффицент() 
	/// Комлев АА 19/11/24 ++++
	ЭлементОформления = СписокНоменклатурыКоэффицент.УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КолвоОстаток");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("КолвоОстаток");
	ПолеОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоКоралловый);
	/// Комлев АА 19/11/24 ---
КонецПроцедуры
